Revit 2022 API
Connector.Flow Property
The flow of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
public double Flow { get; }
Visual Basic
Public ReadOnly Property Flow As Double
	Get
Visual C++
public:
property double Flow {
	double get ();
}
Remarks
Instantaneous flow at this connector, calculated according to system.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the connector's domain is not DomainPiping or DomainHvac.
See Also
Connector Class
Autodesk.Revit.DB Namespace